# **SQL Exercise**

## **Activity 1** 

Practice performing CRUD operations (Create, Read, Update, Delete) on a database table.

### **Perform the following tasks:**

In [1]:
import sqlite3

1. Connect to the database `abc_corp.db` and create the cursor.

In [2]:
conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

In [3]:
cursor.execute("DROP TABLE books;")
conn.commit()

2. `Create` a new table named books, with the following columns:
  * book_id (primary Key)
  * title (Title of the book)
  * author (Author of the book)
  * genre (Genre of the book)
  * publication_year (Year of publication)
  * price (Price of the Book)

In [4]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS books (
               book_id INT PRIMARY KEY,
               title VARCHAR(50) NOT NULL,
               author VARCHAR(50) NOT NULL,
               genre VARCHAR(50),
               publication_year DATE NOT NULL,
               price DECIMAL(10, 2) NOT NULL
)
""")
conn.commit()

3. `Insert` at least 5 new books into the books table.

In [5]:
cursor.execute("""
                INSERT INTO books (book_id, title, author, genre, publication_year, price) 
                VALUES (1, "Omniscient Reader's Viewpoint", 'Sing-Shong (싱숑)', 'Action, Adventure, Psychological, Sci-fi, Supernatural, Tragedy', 2018, 20.22);
""")
cursor.execute("""
                INSERT INTO books (book_id, title, author, genre, publication_year, price) 
                VALUES (2, 'To Be a Heartthrob in a Horror Movie', 'Jiang Zhi Yu (姜之鱼)', 'Adventure, Comedy, Horror, Mystery', 2018, 10.00);
""")
cursor.execute("""
                INSERT INTO books (book_id, title, author, genre, publication_year, price) 
                VALUES (3, 'Number One Lazy Merchant of the Beast World', 'shui shan (水杉)', 'Fantasy, Romance, Sci-fi', 2018, 11.00);
""")
cursor.execute("""
                INSERT INTO books (book_id, title, author, genre, publication_year, price) 
                VALUES (4, 'The Lost Tomb', 'Nan Pai San Shu (南派三叔)', 'Action, Adventure, Horror, Supernatural ', 2011, 34.00);
""")
cursor.execute("""
                INSERT INTO books (book_id, title, author, genre, publication_year, price) 
                VALUES (5, 'Solo Leveling', 'Chugong (추공)', 'Action, Adventure, Fantasy, Supernatural', 2016, 24.00);
""")
conn.commit()

4. `Retrieve` all books from the books table.

In [6]:
cursor.execute("SELECT * FROM books;")
cursor.fetchall()

[(1,
  "Omniscient Reader's Viewpoint",
  'Sing-Shong (싱숑)',
  'Action, Adventure, Psychological, Sci-fi, Supernatural, Tragedy',
  2018,
  20.22),
 (2,
  'To Be a Heartthrob in a Horror Movie',
  'Jiang Zhi Yu (姜之鱼)',
  'Adventure, Comedy, Horror, Mystery',
  2018,
  10),
 (3,
  'Number One Lazy Merchant of the Beast World',
  'shui shan (水杉)',
  'Fantasy, Romance, Sci-fi',
  2018,
  11),
 (4,
  'The Lost Tomb',
  'Nan Pai San Shu (南派三叔)',
  'Action, Adventure, Horror, Supernatural ',
  2011,
  34),
 (5,
  'Solo Leveling',
  'Chugong (추공)',
  'Action, Adventure, Fantasy, Supernatural',
  2016,
  24)]

5. `Update` the price of a specific book.

In [7]:
cursor.execute("""
    UPDATE books SET price = 15.20
    WHERE book_id = 1; 
               """)
conn.commit() # book_id = 1 index 1
cursor.execute("SELECT * FROM books;")
cursor.fetchone()

(1,
 "Omniscient Reader's Viewpoint",
 'Sing-Shong (싱숑)',
 'Action, Adventure, Psychological, Sci-fi, Supernatural, Tragedy',
 2018,
 15.2)

6. `Delete` a book from the table.

In [8]:
cursor.execute("DELETE FROM books WHERE book_id = 5;")
conn.commit()

In [ ]:
cursor.execute("SELECT * FROM books;")
cursor.fetchall()

[(1,
  "Omniscient Reader's Viewpoint",
  'Sing-Shong (싱숑)',
  'Action, Adventure, Psychological, Sci-fi, Supernatural, Tragedy',
  2018,
  15.2),
 (2,
  'To Be a Heartthrob in a Horror Movie',
  'Jiang Zhi Yu (姜之鱼)',
  'Adventure, Comedy, Horror, Mystery',
  2018,
  10),
 (3,
  'Number One Lazy Merchant of the Beast World',
  'shui shan (水杉)',
  'Fantasy, Romance, Sci-fi',
  2018,
  11),
 (4,
  'The Lost Tomb',
  'Nan Pai San Shu (南派三叔)',
  'Action, Adventure, Horror, Supernatural ',
  2011,
  34)]

## **Activity 2** 

Practice using SQL queries with LIMIT, COUNT, and WHERE Clause along with comparison, logical, and special operators.

### **Perform the following tasks:**

1. Create a table named `Students` and add these columns:
  * **student_id** : This column stores the unique identifier for each student, serving as the primary key of the table.
  * **name** : It holds the full name of the student, allowing for the storage of both the first name and last name within a maximum length of 50 characters.
  * **age** : This column represents the age of the student in years, stored as an integer value.
  * **gender** : It stores the gender of the student, allowing for the classification as either "Male" or "Female" within a maximum length of 10 characters.
  * **grade** : This column holds the grade level of the student, typically represented by a single character such as 'A', 'B', 'C', 'D', indicating academic performance or class standing.

In [9]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS Students (
               student_id INT PRIMARY KEY,
               name VARCHAR(50) NOT NULL,
               age INT NOT NULL,
               gender VARCHAR(6) NOT NULL,
               grade VARCHAR(1) NOT NULL
)
""")
conn.commit()

2. Insert the provided data below into the students table.

| student_id | name             | age | gender | grade |
| ---------- | ---------------- | --- | ------ | ----- |
| 1          | John Di          | 18  | Male   | A     |
| 2          | Emily Clark      | 17  | Female | B     |
| 3          | Michael Santos   | 19  | Male   | C     |
| 4          | Sarah Davis      | 16  | Female | A     |
| 5          | David Poms       | 18  | Male   | B     |
| 6          | Jessica Parker   | 17  | Female | A     |
| 7          | Matthew Ross     | 19  | Male   | D     |
| 8          | Ashey Lim        | 18  | Female | C     |
| 9          | Christopher Chen | 17  | Male   | D     |
| 10         | Amanda Hanes     | 16  | Female | B     |

In [10]:
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (1, 'John Di', 18, 'Male', 'A');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (2, 'Emily Clark', 17, 'Female', 'B');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (3, 'Micheal Santos', 19, 'Male', 'C');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (4, 'Sarah Davis', 16, 'Female', 'A');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (5, 'David Poms', 18, 'Male', 'B');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (6, 'Jessica Parker', 17, 'Female', 'A');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (7, 'Matthew Ross', 19, 'Male', 'D');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (8, 'Ashey Lim', 18, 'Female', 'C');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (9, 'Christopher Chen', 17, 'Male', 'D');
""")
cursor.execute("""
                INSERT INTO Students (student_id, name, age, gender, grade) 
                VALUES (10, 'Amanda Hanes', 16, 'Female', 'B');
""")
conn.commit()

3. Retrieve only the name and grade columns for all students.

In [12]:
cursor.execute("SELECT name, grade FROM Students;")
cursor.fetchall()

[('John Di', 'A'),
 ('Emily Clark', 'B'),
 ('Micheal Santos', 'C'),
 ('Sarah Davis', 'A'),
 ('David Poms', 'B'),
 ('Jessica Parker', 'A'),
 ('Matthew Ross', 'D'),
 ('Ashey Lim', 'C'),
 ('Christopher Chen', 'D'),
 ('Amanda Hanes', 'B')]

4. Retrieve male students older than 18 years old.

In [16]:
cursor.execute("""SELECT name, gender, age FROM Students
               WHERE age > 18 AND gender = "Male";
               """)
cursor.fetchall()

[('Micheal Santos', 'Male', 19), ('Matthew Ross', 'Male', 19)]

5. Retrieve the name and age of students who are older than or equal to 18.

In [18]:
cursor.execute("""SELECT name, age FROM Students
               WHERE age >= 18;
               """)
cursor.fetchall()

[('John Di', 18),
 ('Micheal Santos', 19),
 ('David Poms', 18),
 ('Matthew Ross', 19),
 ('Ashey Lim', 18)]

6. Retrieve the name and gender of students who are either 16 years old or have a grade of 'A'.

In [21]:
cursor.execute("""SELECT name, gender, grade, age FROM Students
               WHERE age == 16 OR grade == "A";
               """)
cursor.fetchall()

[('John Di', 'Male', 'A', 18),
 ('Sarah Davis', 'Female', 'A', 16),
 ('Jessica Parker', 'Female', 'A', 17),
 ('Amanda Hanes', 'Female', 'B', 16)]

7. Retrieve the name, age, and grade of female students who are younger than 18.

In [22]:
cursor.execute("""SELECT name, age, grade FROM Students
               WHERE age <= 18 AND gender == "Female";
               """)
cursor.fetchall()

[('Emily Clark', 17, 'B'),
 ('Sarah Davis', 16, 'A'),
 ('Jessica Parker', 17, 'A'),
 ('Ashey Lim', 18, 'C'),
 ('Amanda Hanes', 16, 'B')]

8. Retrieve the count of male students.

In [23]:
cursor.execute("""SELECT COUNT(*) FROM Students
               WHERE gender == "Male";
               """)
cursor.fetchall()

[(5,)]

9. Retrieve the students who are between 16 or 19 years old.

In [29]:
cursor.execute("""SELECT name, age FROM Students
               WHERE 16 <= age <=19 
               ORDER BY age ASC;
               """)
# WHERE age BETWEEN 16 AND 19 ;
cursor.fetchall()

[('Sarah Davis', 16),
 ('Amanda Hanes', 16),
 ('Emily Clark', 17),
 ('Jessica Parker', 17),
 ('Christopher Chen', 17),
 ('John Di', 18),
 ('David Poms', 18),
 ('Ashey Lim', 18),
 ('Micheal Santos', 19),
 ('Matthew Ross', 19)]

10. Retrieve the name and grade of students whose grades are 'B' or 'C' and are older than or equal to 18 years old.

In [ ]:
cursor.execute("""SELECT name, grade, age FROM Students
               WHERE (grade = "B" OR grade = "C") AND age >= 18;
               """)
cursor.fetchall()

[('Micheal Santos', 'C', 19), ('David Poms', 'B', 18), ('Ashey Lim', 'C', 18)]

11. Retrieve the name and age of students whose names start with 'A'.

In [52]:
cursor.execute("""SELECT name, age FROM Students
               WHERE name LIKE 'A%';
               """)
cursor.fetchall()

[('Ashey Lim', 18), ('Amanda Hanes', 16)]

12. Retrieve the first 5 students whose names contain the letter 'i'.

In [55]:
cursor.execute("""SELECT * FROM Students
               WHERE name LIKE '%i%'
               LIMIT 0, 5;
               """)
cursor.fetchall()

[(1, 'John Di', 18, 'Male', 'A'),
 (2, 'Emily Clark', 17, 'Female', 'B'),
 (3, 'Micheal Santos', 19, 'Male', 'C'),
 (4, 'Sarah Davis', 16, 'Female', 'A'),
 (5, 'David Poms', 18, 'Male', 'B')]